In [2]:
%matplotlib inline
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns
import pandas as pd
plt.style.use('ggplot')

In [8]:
df = pd.read_csv('./../data/tested.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [13]:
df = df.dropna()

In [11]:
colonnes = ['Survived', 'Pclass', 'Sex', 'Age']
df = df[colonnes]

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 332 entries, 0 to 415
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  332 non-null    int64
 1   Pclass    332 non-null    int64
 2   Sex       332 non-null    object
 3   Age       332 non-null    float64
dtypes: float64(1), int64(2), object(1)
memory usage: 13.0+ KB

In [15]:
df.head()

   Survived  Pclass     Sex   Age
0         0       3    male  34.5
1         1       3  female  47.0
2         0       2    male  62.0
3         0       3    male  27.0
4         1       3  female  22.0

In [ ]:
df.to_csv('./../data/titanic.csv', index=False, )